#include <stdio.h>

int main( )
{
	int c[2][4]={{1,2,3,4},{11,12,13,14}},i;
	
    int *p;//p为指向整型变量的指针
    /*
    float c[2][4]={{1.1,2.3,3,4},{11,12,13,14}};//p为指向整型变量的指针
	int i;
    float *p;//p为指向浮点型变量的指针
    float *a[8];
    */

    int *a[8];   //a[8]为指针数组，是数组（维数为1，长度为8），该数组较特殊（数组元素为指针，指向整型变量），可如此看:int* a[8]，即int*当作变量类型;
	
    int (*b)[4]; //b为指向数组的指针，是指针，该指针较特殊（指向数组，被指向的数组的维数为1，长度为4，元素类型为整型），可如此看:int[4]* b，即int[4]*当作变量类型;

	
    for (p = &c[0][0],i=0; p <= &c[1][3]; p++) {//p = &c[0][0]也可p = c[0]
		a[i]=p; //将c[2][4]中第一个元素(c[0][0])到最后一个元素(c[1][3])的共8个地址值赋值给数组a[8]
		printf("a[%d]=%d\n",i,a[i]);
		i++;
	}

    for (b = &c[0]; b < &c[2]; b++) {//b = &c[0]也可b = c，但是不能b = &c[0][0]
		printf("(*b)[1]=%d\n",(*b)[1]);	//(*b)[1]为间接寻址操作，即通过b分别指向数组c[0]={1,2,3,4}和c[1]={11,12,13,14}的第2个元素(index=1)所对应的地址，间接访问该数组元素的值

	} //b是指向元素是一维数组的指针
	
    //printf("&c[0][0]=%d\n   &c[0]=%d\n",&c[0][0],&c[0]);

    for (i = 0; i < 2; i++) {
		printf("c[%d][1]=%d\n",i,c[i][1]);	
	}	

 	return 0;
}
